tap "beeftornado/rmtree"
tap "blacktop/tap"
tap "ggpeti/rmrec"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/core"
tap "homebrew/services", "https://mirrors.ustc.edu.cn/homebrew-services.git"
tap "jandedobbeleer/oh-my-posh"
tap "lihaoyun6/tap"
tap "mongodb/brew"
tap "playcover/playcover"
tap "v2raya/v2raya"
tap "xpipe-io/tap"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Utility to check whether MAC addresses are already taken on a LAN
brew "arping"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin", restart_service: :changed
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Shell extension to jump to frequently used directories
brew "autojump"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Concurrent, cache-efficient, and Dockerfile-agnostic builder toolkit
brew "buildkit"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Tool for managing apps on iOS devices
brew "ideviceinstaller"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Run a Kubernetes cluster locally
brew "minikube"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# CLI csv pretty printer
brew "tidy-viewer"
# Platform for building proxies to bypass network restrictions
brew "v2ray"
# Command-line client for WebSockets
brew "websocat"
# Internet file retriever
brew "wget"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Android SDK component
cask "android-platform-tools"
# PHP and Web development environment manager
cask "flyenv"
cask "font-fira-code-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Music app base on Electron & Vue
cask "lx-music"
# File system integration
cask "macfuse"
# Graphical user interface for the command terminal
cask "macpilot"
# Re-mounts write-protected NTFS volumes
cask "mounty"
# Quick Look plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin for JSON files
cask "quicklook-json"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Standalone client for sing-box, the universal proxy platform
cask "sfm"
# Manage Homebrew packages with a UI
cask "wailbrew"
# Your entire server infrastructure at your fingertips
cask "xpipe-io/tap/xpipe"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-vscode.makefile-tools"
go "github.com/go-delve/delve/cmd/dlv"
go "unlock-music.dev/cli/cmd/um"
npm "@vue/cli"
npm "corepack"
npm "firebase-tools"
npm "yarn"
